# Brewfile for macOS Setup
# Install with: brew bundle install

# CLI Tools
brew "awscli"
brew "bash"
brew "bat"
brew "direnv"
brew "git"
brew "jq"
brew "micro"
brew "pipenv"
brew "python@3.13"
brew "rbenv"
brew "ruby-build"
brew "zsh"
brew "zsh-autosuggestions"

# Desktop Applications
cask "brave-browser"
cask "docker"
cask "iterm2"
cask "logseq"
cask "rectangle"
cask "synology-drive"
cask "visual-studio-code"
